app/views/diagnoses/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "stone_categories" ON "categories"."id" = "stone_categories"."category_id" WHERE "stone_categories"."power_stone_id" = $1  [["power_stone_id", 1]]
---
    タグ:
    <% power_stone.categories.each do |category| %>