app/views/diagnoses/new.html.erb

SELECT "categories".* FROM "categories"
---

<% categories = Category.select(&:name) %>

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
] %>
<% question_id = Category.first.id %>