app/controllers/diagnoses_controller.rb

  def index
    power_stones = PowerStone.all
    selected_category_ids = params[:answer]
    @match_category_count = 0
    tmp_match_category_count = 0
    @matched_power_stones = []
    if selected_category_ids == nil
      redirect_to diagnoses_new_path, alert: '「 1つ以上チェックが必要です 」'
    else
      power_stones.each do |power_stone|
        tmp_match_category_count = 0
        power_stone.categories.each do |category|
---
SELECT "power_stones".* FROM "power_stones"
SELECT "categories".* FROM "categories" INNER JOIN "stone_categories" ON "categories"."id" = "stone_categories"."category_id" WHERE "stone_categories"."power_stone_id" = $1  [["power_stone_id", 1]]