app/controllers/power_stones_controller.rb

SELECT "power_stones".* FROM "power_stones"
---
  def index
    #@power_stones = PowerStone.all
    @power_stones = PowerStone.all.includes([:have_stones])

INSERT INTO "power_stones" ("name", "overview", "created_at", "updated_at", "power_stone_image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ルビー"], ["overview", "11111"], ["created_at", "2023-02-13 13:11:46.268253"], ["updated_at", "2023-02-13 13:11:46.268253"], ["power_stone_image", "ruby.jpg"]]
---
  def create
    @power_stone = PowerStone.new(power_stone_params)

    respond_to do |format|
      if @power_stone.save

UPDATE "power_stones" SET "updated_at" = $1, "power_stone_image" = $2 WHERE "power_stones"."id" = $3  [["updated_at", "2023-02-13 13:12:29.536970"], ["power_stone_image", "amethyst__1_.jpg"], ["id", 1]]
---
  def update
    if @power_stone.update(power_stone_params)

DELETE FROM "power_stones" WHERE "power_stones"."id" = $1  [["id", 8]]
---
  def destroy
    @power_stone.destroy

SELECT "power_stones".* FROM "power_stones" WHERE "power_stones"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_power_stone
      @power_stone = PowerStone.find(params[:id])