app/views/power_stones/_form.html.erb

  <div class='form-group'>
    <%= form.collection_check_boxes(:category_ids, Category.all, :id, :name) do |category| %>
---
SELECT "categories".* FROM "categories"