app/views/power_stones/_form.html.slim

  .form-group
    = form.collection_check_boxes(:category_ids, Category.all, :id, :name) do |category|
      .form-check
---
SELECT "categories".* FROM "categories"