app/views/power_stones/_power_stone.html.slim

  = image_tag power_stone.power_stone_image.url, id: 'preview', size: '200x200'
- power_stone.categories.each do |category|
---
SELECT "categories".* FROM "categories" INNER JOIN "stone_categories" ON "categories"."id" = "stone_categories"."category_id" WHERE "stone_categories"."power_stone_id" = $1  [["power_stone_id", 1]]