app/views/power_stones/_power_stone.html.erb


  <% power_stone.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "stone_categories" ON "categories"."id" = "stone_categories"."category_id" WHERE "stone_categories"."power_stone_id" = $1  [["power_stone_id", 1]]